package com.example.cloudfinal

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.view.Menu
import android.view.MenuItem
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView
import com.example.cloudfinal.adapter.DiseasesAdapter
import com.example.cloudfinal.adapter.PostAdapter
import com.example.cloudfinal.databinding.ActivityDiseasesBinding
import com.example.cloudfinal.databinding.ActivityPostsBinding
import com.example.cloudfinal.model.Diseases
import com.example.cloudfinal.model.Post
import com.example.cloudfinal.sign.LoginActivity
import com.google.firebase.auth.FirebaseAuth
import com.google.firebase.auth.ktx.auth
import com.google.firebase.database.DataSnapshot
import com.google.firebase.database.DatabaseError
import com.google.firebase.database.DatabaseReference
import com.google.firebase.database.FirebaseDatabase
import com.google.firebase.database.GenericTypeIndicator
import com.google.firebase.database.ValueEventListener
import com.google.firebase.ktx.Firebase

class DiseasesActivity : AppCompatActivity() {
    private lateinit var userRecyclerView: RecyclerView
    private lateinit var postsList: ArrayList<Diseases>
    private lateinit var adapter: DiseasesAdapter
    private lateinit var binding: ActivityDiseasesBinding
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        binding = ActivityDiseasesBinding.inflate(layoutInflater)
        setContentView(binding.root)
        postsList = ArrayList()
        adapter = DiseasesAdapter(this, postsList)
        userRecyclerView = binding.userRecyclerView
        userRecyclerView.layoutManager = LinearLayoutManager(this)
        userRecyclerView.adapter = adapter
                postsList.clear()

        postsList.add(Diseases("سرطان" , "هو مجموعة من الأمراض التي تتميز خلاياها بالتوغل والانتشار (وهو النمو والانقسام الخلوي غير المحدود)، هذه الخلايا المنقسمة لها القدرة على غزو الأنسجة المجاورة وتدميرها، أو الانتقال إلى أنسجة بعيدة في عملية يُطلق عليها الانبثاث. وهذه القدرات هي صفات الورم الخبيث على عكس الورم الحميد، الذي يتميز بنمو محدد وعدم القدرة على الغزو أوالقدرة على الانتقال. مع ذلك يمكن أن يتطور الورم الحميد إلى سرطان خبيث في بعض الأحيان. حوالي 5-10% من السرطانات تحدث بسبب عيوب جينية وراثية من والدي الشخص ويمكن الكشف عن السرطان بعلامات وأعراض معينة أو اختبارات فحص. وبعد ذلك يتم إجراء المزيد من الاختبارات عن طريق التصوير الطبي والتأكيد بأخذ خزعة.\n" +
                "\n" +
                "السرطان هو ثاني سبب رئيسي للوفاة على مستوى العالم، وهو مسؤول عن ما يقدر بـ 9.6 مليون حالة وفاة في عام 2018. على الصعيد العالمي، حوالي 1 من كل 6 حالات وفاة بسبب السرطان. إن تعاطي التبغ هو سبب حوالي 22% من وفيات السرطان. 10% أخرى ترجع إلى السمنة أو سوء التغذية أو قلة النشاط البدني أو الإفراط في شرب الكحول. وتشمل العوامل الأخرى بعض أنواع العدوى والتعرض للإشعاع والملوثات البيئية. في العالم النامي، 15% من السرطانات ناتجة عن عدوى مثل هيليكوباكتر بيلوري، والتهاب الكبد ب، والتهاب الكبد سي، وعدوى فيروس الورم الحليمي البشري، وفيروس إيبشتاين-بار، وفيروس نقص المناعة البشرية. تعمل هذه العوامل، جزئيًا على الأقل، عن طريق تغيير جينات الخلية. لذلك يمكن منع العديد من السرطانات من خلال عدم التدخين، والحفاظ على وزن صحي، وعدم شرب الكحول، وتناول الكثير من الخضار والفواكه والحبوب الكاملة، والتطعيم ضد بعض الأمراض المعدية، وعدم تناول الكثير من اللحوم المصنعة والحمراء وتجنب التعرض الشديد لأشعة الشمس.\n" +
                "\n" +
                "أكثر أنواع السرطان شيوعًا لدى الذكور هي سرطان الرئة وسرطان القولون والمستقيم وسرطان البروستاتا ووسرطان المعدة. أما في الإناث، الأنواع الأكثر شيوعًا هي سرطان الثدي وسرطان القولون والمستقيم وسرطان الرئة وسرطان عنق الرحم. إذا تم إدراج سرطان الجلد بخلاف الورم الميلانيني في إجمالي حالات السرطان الجديدة كل عام، فسيكون ذلك يمثل حوالي 40% من الحالات. في الأطفال، يكون سرطان الدم الليمفاوي الحاد وأورام الدماغ أكثر شيوعًا، باستثناء أفريقيا حيث تحدث الأورام اللمفاوية غير الهودجكينية في كثير من الأحيان. في عام 2012، تم تشخيص حوالي 165,000 طفل دون سن 15 عامًا بالسرطان. يستطيع السرطان أن يصيب كل المراحل العمرية عند الإنسان حتى الأجنة، ولكن تزيد مخاطر الإصابة به كلما تقدم الإنسان في العمر. ويسبب السرطان الوفاة بنسبة 13% من جميع حالات الوفاة."))
        postsList.add(Diseases("الخرف" , "الخرف مصطلح للعديد من الأمراض التي تؤثر في الذاكرة والتفكير والقدرة على أداء الأنشطة اليومية.\n" +
                "\n" +
                "ويزداد المرض سوءًا بمرور الوقت. ويؤثر بشكل رئيسي في كبار السن ولكن هذا لا يعني أن جميع الأشخاص سيصابون به مع تقدمهم في العمر.\n" +
                "\n" +
                "وتتضمن العوامل التي تزيد من خطر الإصابة بالخرف ما يلي:\n" +
                "\n" +
                "العمر (أكثر شيوعًا وسط من يبلغون من العمر 65 عامًا أو أكبر)\n" +
                "ارتفاع ضغط الدم (فرط ضغط الدم)\n" +
                "ارتفاع نسبة السكر في الدم (داء السكري)\n" +
                "زيادة الوزن أو السمنة\n" +
                "التدخين\n" +
                "شرب الكثير من الكحول\n" +
                "الخمول البدني\n" +
                "العزلة الاجتماعية\n" +
                "الاكتئاب.\n" +
                "الخرف متلازمة يمكن أن يسببها عدد من الأمراض التي تتلف بمرور الوقت الخلايا العصبية وتتلف الدماغ، مما يؤدي في العادة إلى تدهور الوظيفة الإدراكية (أي القدرة على التفكير) على نحو يتجاوز ما يمكن توقعه من النتائج المعتادة للشيخوخة البيولوجية. وفي حين أن الوعي لا يتأثر، فإن القصور في الوظيفة الإدراكية تصاحبه عادة تغيرات في المزاج أو التحكم العاطفي أو السلوك أو الهمة.\n" +
                "\n" +
                "وللخرف أضرار جسدية ونفسية واجتماعية واقتصادية، لا تقتصر فقط على الأشخاص المصابين بالخرف، ولكن تمتد لتشمل من يقدمون الرعاية إليهم، فضلاً عن أسرهم والمجتمع بأسره. وغالبًا ما يكون هناك قصور في فهم الخرف وإدراكه، مما يؤدي إلى الوصم ووضع الحواجز أمام التشخيص والرعاية."))
        postsList.add(Diseases("الزهايمر" , "داء الزهايمر اضطراب في الدماغ يتفاقم بمرور الوقت. ويتسم بحدوث تغيرات في الدماغ تؤدي إلى ترسبات لبعض البروتينات. يسبب داء الزهايمر تقلصًا في الدماغ وموت خلاياه في النهاية. وداء الزهايمر هو السبب الأكثر شيوعًا للإصابة بالخَرَف؛ وهو تدهور تدريجي في الذاكرة والقدرة على التفكير والمهارات السلوكية والاجتماعية. ويمكن أن تؤثر هذه التغيرات في قدرة الشخص على أداء وظائفه.\n" +
                "\n" +
                "يعيش في الولايات المتحدة نحو 6.5 ملايين مصاب بداء الزهايمر في سن 65 فأكبر. ومنهم أكثر من 70% في سن 75 عامًا فأكبر. ويُقدر المصابون بداء الزهايمر بنسبة تتراوح بين 60% و70% من بين 55 مليون شخص تقريبًا من المصابين بالخَرَف في جميع أنحاء العالم.\n" +
                "\n" +
                "تشمل المؤشرات المبكرة للمرض نسيان الأحداث أو المحادثات الأخيرة. وبمرور الوقت، يتطور ليسبب مشكلات خطيرة في الذاكرة وفقدان القدرة على أداء المهام اليومية.\n" +
                "\n" +
                "قد تحسِّن الأدوية أعراض المرض مؤقتًا أو تبطئ تقدمه. كما يمكن أن تساعد البرامج والخدمات على دعم الأشخاص المصابين بالمرض ومقدّمي الرعاية إليهم.\n" +
                "\n" +
                "لا يوجد علاج يشفي من داء الزهايمر. وفي المراحل المتقدمة، يؤدي التدهور الشديد في وظائف الدماغ إلى الجفاف أو سوء التغذية أو العدوى. ويمكن أن تؤدي هذه المضاعفات إلى الوفاة."))
        postsList.add(Diseases("باركنسون" , "داء باركنسون هو اضطراب يتفاقم تدريجيًا يؤثر على الجهاز العصبي وأجزاء الجسم التي تسيطر عليها الأعصاب. وتبدأ الأعراض ببطء. وقد يكون أول الأعراض ظهورًا رُعاش لا يكاد يُلحظ في يد واحدة فقط. وحدوث الرُعاش من الأعراض الشائعة، لكن الاضطراب قد يسبب أيضًا تيبّسًا وبطئًا في الحركة.\n" +
                "\n" +
                "في المراحل المبكرة من داء باركنسون، قد يظهر على وجهك بعض التعبيرات القليلة، أو لا تظهر على الإطلاق. وقد لا تتأرجح ذراعاك أثناء المشي. وقد يصبح النطق ضعيفًا أو غير واضح. وتزداد أعراض داء باركنسون سوءًا بتفاقم حالتك بمرور الوقت.\n" +
                "\n" +
                "على الرغم من أن داء باركنسون لا شفاء له، إلا أن الأدوية يمكنها تخفيف الأعراض إلى حد كبير. وفي بعض الأحيان، قد يقترح عليك الطبيب إجراء جراحة لتنظيم عمل مواضع محددة من الدماغ وتحسين الأعراض."))
        postsList.add(Diseases("الفشل الكلوي" , "يحدث الفشل الكلوي الحاد عندما تعجز الكلى فجأةً عن تنقية الفضلات من الدم. وعندما تفقد الكليتان وظيفتهما على القيام بعملية التنقية، فقد تتزايد مستويات الفضلات الخطرة مما قد يتسبب في إحداث خلل بالتركيب الكيميائي للدم.\n" +
                "\n" +
                "يُطلَق أيضًا على الفشل الكلوي الحاد اسم الفشل الكلوي المزمن أو إصابة حادة بالكُلى، ويُصاب الأشخاص بالمرض بسرعة، عادةً في أقل من بضعة أيام. إن الفشل الكلوي الحاد هو الأكثر شيوعًا بين الأشخاص المحتجزين بالفعل في المستشفى، وخاصةً المصابين بأمراض خطيرة ويحتاجون إلى عناية مركزة.\n" +
                "\n" +
                "يمكن أن يكون الفشل الكلوي الحاد قاتلًا ويتطلب علاجًا مكثفًا. بالرغم من ذلك، فقد يمكن علاج الفشل الكلوي الحاد. فإذا كانت حالتك الصحية جيدة، فقد تتعافي وظيفة الكلى لتصبح طبيعية أو شبه طبيعية."))


        adapter.notifyDataSetChanged()
            }



    override fun onCreateOptionsMenu(menu: Menu?): Boolean {
        menuInflater.inflate(R.menu.appbar, menu)
        return super.onCreateOptionsMenu(menu)
    }

    override fun onOptionsItemSelected(item: MenuItem): Boolean {
        Firebase.auth.signOut()
        val intent = Intent(this, LoginActivity::class.java)
        startActivity(intent)
        finish()
        return super.onContextItemSelected(item)
    }
}